---
kind: property
id: P:Autodesk.Revit.DB.LinePattern.Name
source: html/7e119c9d-e823-f43d-8845-62d4c58bd643.htm
---
# Autodesk.Revit.DB.LinePattern.Name Property

Line pattern name.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null